In [1]:
import pandas as pd
import numpy as np

In [2]:
data_h1b=pd.read_csv('h1b_kaggle.csv')

In [3]:
data_h1b.head()

,Unnamed: 0,CASE_STATUS,EMPLOYER_NAME,SOC_NAME,JOB_TITLE,FULL_TIME_POSITION,PREVAILING_WAGE,YEAR,WORKSITE,lon,lat
0,1,CERTIFIED-WITHDRAWN,UNIVERSITY OF MICHIGAN,BIOCHEMISTS AND BIOPHYSICISTS,POSTDOCTORAL RESEARCH FELLOW,N,36067.0,2016.0,"ANN ARBOR, MICHIGAN",-83.743038,42.280826
1,2,CERTIFIED-WITHDRAWN,"GOODMAN NETWORKS, INC.",CHIEF EXECUTIVES,CHIEF OPERATING OFFICER,Y,242674.0,2016.0,"PLANO, TEXAS",-96.698886,33.019843
2,3,CERTIFIED-WITHDRAWN,"PORTS AMERICA GROUP, INC.",CHIEF EXECUTIVES,CHIEF PROCESS OFFICER,Y,193066.0,2016.0,"JERSEY CITY, NEW JERSEY",-74.077642,40.728158
3,4,CERTIFIED-WITHDRAWN,"GATES CORPORATION, A WHOLLY-OWNED SUBSIDIARY O...",CHIEF EXECUTIVES,"REGIONAL PRESIDEN, AMERICAS",Y,220314.0,2016.0,"DENVER, COLORADO",-104.990251,39.739236
4,5,WITHDRAWN,PEABODY INVESTMENTS CORP.,CHIEF EXECUTIVES,PRESIDENT MONGOLIA AND INDIA,Y,157518.4,2016.0,"ST. LOUIS, MISSOURI",-90.199404,38.627003

In [4]:
data_h1bs=data_h1b.sample(n=2000)

In [5]:
s=data_h1b.isnull()

In [6]:
data_h1b.count()

Unnamed: 0            3002458
CASE_STATUS           3002445
EMPLOYER_NAME         3002399
SOC_NAME              2984724
JOB_TITLE             3002415
FULL_TIME_POSITION    3002443
PREVAILING_WAGE       3002373
YEAR                  3002445
WORKSITE              3002458
lon                   2895216
lat                   2895216
dtype: int64

# 缺失数据处理

In [63]:
frame=pd.DataFrame({'序号':[1,2,3,4],'姓名':['张三','李四','李磊','韩梅'],'成绩':['B','C','A','A'],'年龄':[20,21,25,None],'身高':[175,None,None,None]})

使用isnull()函数可以直观的看到每一项是否有缺失，不过如果数据量太大，我们很难找到哪些数据有缺失。

In [8]:
frame.isnull()

      序号     姓名     成绩     年龄     身高
0  False  False  False  False  False
1  False  False  False  False   True
2  False  False  False  False   True
3  False  False  False   True   True

在这个假设的数据集中我们要怎么操作呢？首先我我们可以统计每个特征或者每条记录缺失数据的分布情况。

In [9]:
print(frame.isnull().sum(axis=0)) #纵向统计有多少缺失数据
print(frame.isnull().sum(axis=1)) #横向统计有多少缺失数据

序号    0
姓名    0
成绩    0
年龄    1
身高    3
dtype: int64
0    0
1    1
2    1
3    2
dtype: int64

In [12]:
frame

   序号  姓名 成绩    年龄     身高
0   1  张三  B  20.0  175.0
1   2  李四  C  21.0    NaN
2   3  李磊  A  25.0    NaN
3   4  韩梅  A   NaN    NaN

从获取的信息中可以看出，在年龄这个特征中有1个缺失数据，在身高特征有3个缺失数据。在第2，3条记录分别有一个缺失数据，第4条有两个缺失数据。我们可以简单的删除这些有缺失数据的项，操作及结果如下。

In [13]:
frame_dropall=frame.dropna() #删除所有有缺失数据的记录
frame

   序号  姓名 成绩    年龄     身高
0   1  张三  B  20.0  175.0

可以看到dropna函数把所有的含有缺失数据的记录都删除了。不过很可能经过缺失数据删除后的数据集规模太小而无法使用，在这种情况下我们可以通过对缺失数据填补和删除特征来保持数据集规模。

首先是年龄特征，我们经过对表的简单分析，可以看出这是一个学生成绩的表，所以学生的年龄应该差不多，我们可以用平均值来填补。

In [46]:
frame2=frame.fillna({'年龄':frame['年龄'].mean()}) #填充年龄的平均值

fillna函数中的值可以是字典，它可以对某一列或者某几列的缺失数据进行操作。

In [48]:
frame2

   序号  姓名 成绩    年龄     身高
0   1  张三  B  20.0  175.0
1   2  李四  C  21.0    NaN
2   3  李磊  A  25.0    NaN
3   4  韩梅  A  22.0    NaN

这里我们就把年龄的缺失数据填上了，那么对于身高呢？经过观察可以发现，身高的缺失数据非常多，占到所有数据的75%。我们当然可以按照平均值来填补数据，但是会造成身高这一项失去特征表达的作用，因为所有项目都一样，因此我们可以删除这一列。这样可以尽可能的保留数据集中的数据。

In [49]:
frame2.dropna(axis=1)  #按照列删除缺失数据，这里参数axis表达删除的方向，0表示按行删除，1表示按列删除。删除的是有缺失数据的一整行或列。

   序号  姓名 成绩    年龄
0   1  张三  B  20.0
1   2  李四  C  21.0
2   3  李磊  A  25.0
3   4  韩梅  A  22.0

下面列出之前使用的dropna和fillna的所有用法。

DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

### dropna

| 参数 | 用法|
| :- | :- |
|axis|控制移除缺失数据的行或者列。有两个参数{0 或者 'index',1 或者 'columns'}，如果输入是0或者'index'则移除缺失数据的行（记录），如果输入是1或者'columns'就移除有缺失数据的列。默认是0。|
|how|决定空缺数据移除出数据集的方式。有两个参数{'any','all'},如果输入是'any'只要这一行（列）有缺失数据，就移除这一行（列）。如果输入是'all'则只有在这一行（列）数据全部缺失后才移除。
|tresh|控制每行（列）留下的非缺失数据个数。输入一个int型整数。
|subset|控制从哪一行（列）寻找缺失数据。输入一个列表。如果想删除有缺失数据的行，就读入特征名作为列表里的值。
|inplace|控制操作是直接作用在数据集上还是副本上。有两个参数{True，False},如果输入是True则在原始数据集上直接操作，返回None。如果是False则在生成的副本上操作，返回操作完成的副本。

下面对之前没有提到的操作进行举例说明，方便理解。

In [59]:
frame_thr=frame.dropna(thresh=4) #控制有效值超过4个的数据记录保留
print(frame_thr)

   序号  姓名 成绩    年龄     身高
0   1  张三  B  20.0  175.0
1   2  李四  C  21.0    NaN
2   3  李磊  A  25.0    NaN

In [60]:
frame_sub=frame.dropna(subset=['年龄']) #加入subset参数表示只观察年龄特征的参数，而不管其他特征是否有缺失数据
print(frame_sub)

   序号  姓名 成绩    年龄     身高
0   1  张三  B  20.0  175.0
1   2  李四  C  21.0    NaN
2   3  李磊  A  25.0    NaN

In [62]:
frame_in=frame.dropna(inplace=True) #可以看到inplace为True时函数直接在原始数据集上进行了操作，返回值是None
print(frame)
print(frame_in)

   序号  姓名 成绩    年龄     身高
0   1  张三  B  20.0  175.0
None

### fillna
DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None, **kwargs)

|参数|用法|
|:--:|:--:|
|value|需要填补的数据。允许读入的数据类型有标量数据、字典、序列和数据集。字典，序列和数据集可以指定需要填充数据的标签|
|method|可以控制填充的方式。有5个参数{'backfill','bfill','pad','ffill',None},默认为None。
backfill/bfill:用下一个非缺失数据区填充该数据，pad/fill:用前一个非缺失数据去填充该数据。None表示用制定的数据填充该缺失数据。
|axis|控制操作方向。有两个参数{0 或者 'index',1 或者 'columns'}，默认为0。输入0表示按照行操作，1表示按照列操作。
|implace|控制操作是直接作用在数据集上还是副本上。有两个参数{True，False},如果输入是True则在原始数据集上直接操作，返回None。如果是False则在生成的副本上操作，返回操作完成的副本。
|limit| 控制沿轴填充缺失数据的最大个数。输入一个int型整数，默认为None。
|downcast| 控制是否进行类型转换。输入一个字典{'对象':'数据类型'}。

In [71]:
frame=pd.DataFrame({'序号':[1,2,3,4],'姓名':['张三','李四','李磊','韩梅'],'成绩':['B','C','A','A'],'年龄':[None,21,25,None],'身高':[175,None,None,170]})

In [80]:
frame.fillna(method='ffill')

   序号  姓名 成绩    年龄     身高
0   1  张三  B   NaN  175.0
1   2  李四  C  21.0  175.0
2   3  李磊  A  25.0  175.0
3   4  韩梅  A  25.0  170.0

In [76]:
frame

   序号  姓名 成绩    年龄     身高
0   1  张三  B   NaN  175.0
1   2  李四  C  21.0    NaN
2   3  李磊  A  25.0    NaN
3   4  韩梅  A   NaN  170.0